update-webservice/src/main/webapp/HoldingsItemsUpdateServices.examples/create-one.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hol="http://oss.dbc.dk/ns/holdingsItemsUpdate">
    <soapenv:Header/>
    <soapenv:Body>
        <hol:holdingsItemsUpdate>
            <hol:holdingsItemsUpdateRequest>
                <!-- optional -->
                <hol:authentication>
                    <hol:groupIdAut></hol:groupIdAut>
                    <hol:passwordAut></hol:passwordAut>
                    <hol:userIdAut></hol:userIdAut>
                </hol:authentication>
                <hol:agencyId>123456</hol:agencyId>
                <!--0 to 100 repetitions:-->
                <hol:bibliographicItem>
                    <hol:bibliographicRecordId>87654321</hol:bibliographicRecordId>
                    <!-- <hol:note> ? </hol:note> -->
                    <hol:modificationTimeStamp>
                        <hol:modificationDateTime>2015-01-01T00:00:00Z</hol:modificationDateTime>
                        <hol:modificationMilliSeconds>0</hol:modificationMilliSeconds>
                    </hol:modificationTimeStamp>
                    <hol:holding>
                        <hol:expectedDeliveryDate>2020-12-24</hol:expectedDeliveryDate>
                        <hol:readyForLoan>-1</hol:readyForLoan>
                        <hol:issueId>00:1</hol:issueId>
                        <hol:issueText>Some description</hol:issueText>
                        <hol:holdingsItem>
                            <hol:itemId>3</hol:itemId>
                            <hol:branch>The County</hol:branch>
                            <hol:department>The House</hol:department>
                            <hol:location>The Kitchen</hol:location>
                            <hol:subLocation>The Countertop</hol:subLocation>
                            <hol:circulationRule>None</hol:circulationRule>
                            <hol:status>Online</hol:status>
                            <hol:accessionDate>2014-06-26</hol:accessionDate>
                        </hol:holdingsItem>
                    </hol:holding>
                </hol:bibliographicItem>
                <!--Optional:-->
                <hol:trackingId>one</hol:trackingId>
            </hol:holdingsItemsUpdateRequest>
        </hol:holdingsItemsUpdate>
    </soapenv:Body>
</soapenv:Envelope>
