update-webservice/src/main/webapp/HoldingsItemsUpdateServices.examples/complete-collection.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hol="http://oss.dbc.dk/ns/holdingsItemsUpdate">
    <soapenv:Header/>
    <soapenv:Body>
        <hol:completeHoldingsItemsUpdate>
            <hol:completeHoldingsItemsUpdateRequest>
                <!-- optional -->
                <hol:authentication>
                    <hol:groupIdAut></hol:groupIdAut>
                    <hol:passwordAut></hol:passwordAut>
                    <hol:userIdAut></hol:userIdAut>
                </hol:authentication>
                <hol:agencyId>123456</hol:agencyId>
                <!--0 to 100 repetitions:-->
                <hol:completeBibliographicItem>
                    <hol:bibliographicRecordId>87654321</hol:bibliographicRecordId>
                    <!-- <hol:note> ? </hol:note> -->
                    <hol:modificationTimeStamp>
                        <hol:modificationDateTime>2016-01-01T01:00:00Z</hol:modificationDateTime>
                        <hol:modificationMilliSeconds>0</hol:modificationMilliSeconds>
                    </hol:modificationTimeStamp>
                    <!--0 to 100 repetitions:-->
                    <hol:holding>
                        <hol:expectedDeliveryDate>2199-12-31</hol:expectedDeliveryDate>
                        <hol:readyForLoan>-1</hol:readyForLoan>
                        <hol:issueId>10:01</hol:issueId>
                        <hol:issueText>Year #10 Issue #1</hol:issueText>
                        <hol:holdingsItem>
                            <hol:itemId>1</hol:itemId>
                            <hol:branch>The County</hol:branch>
                            <hol:department>The House</hol:department>
                            <hol:location>The Basement</hol:location>
                            <hol:subLocation>The Self</hol:subLocation>
                            <hol:circulationRule>Stays in the basement</hol:circulationRule>
                            <hol:status>NotForLoan</hol:status>
                            <hol:accessionDate>2014-06-26</hol:accessionDate>
                        </hol:holdingsItem>
                        <hol:holdingsItem>
                            <hol:itemId>2</hol:itemId>
                            <hol:branch>The County</hol:branch>
                            <hol:department>The House</hol:department>
                            <hol:location>The Library</hol:location>
                            <hol:subLocation>The Self</hol:subLocation>
                            <hol:circulationRule>None</hol:circulationRule>
                            <hol:status>OnShelf</hol:status>
                            <hol:accessionDate>2014-06-26</hol:accessionDate>
                        </hol:holdingsItem>
                    </hol:holding>
                </hol:completeBibliographicItem>
                <!--Optional:-->
                <hol:trackingId>complete</hol:trackingId>
            </hol:completeHoldingsItemsUpdateRequest>
        </hol:completeHoldingsItemsUpdate>
    </soapenv:Body>
</soapenv:Envelope>
